# ข้อ 1
print(2 ** 2 ** 3)


# ข้อ 2
# print(3 ** 2 ** 2)


# ข้อ 3
# print((3 ** 2) ** 2)


# ข้อ 4
# print(2 ** 3 * 4)


# ข้อ 5
# print(2 * 3 ** 2 + 1)


# ข้อ 6
# print(4 + 2 ** 3 ** 2)


# ข้อ 7
# print((4 + 2) ** 2)


# ข้อ 8
# print(4 + 2 ** 2 * 3)


# ข้อ 9
# print(2 ** 3 ** 2 % 10)


# ข้อ 10
# print(10 - 2 ** 3 ** 1 + 5)


# โจทย์ท้าทายพิเศษ 3 ข้อ
# print(2 ** 1 ** 3 + 4)

# print((2 ** 1) ** 3 + 4)

# print(2 + 3 ** 2 ** 1 * 2)



# และจุดสำคัญคือ

# ผลลัพธ์ของ a % b จะมีเครื่องหมายฝั่งเดียวกับตัวหาร b

# เช่น

# 7 % 3    # 1
# 7 % -3   # -2
# -7 % 3   # 2
# -7 % -3  # -1

# จำสั้น ๆ:

# ตัวหารเป็นบวก  →  เศษเป็น 0 หรือบวก
# ตัวหารเป็นลบ   →  เศษเป็น 0 หรือ ลบ



# ตัวอย่าง 1
# print(7 % 3)


# ตัวอย่าง 2
# print(-7 % 3)

# ตัวอย่าง 3
# print(7 % -3)


# ตัวอย่าง 4
# print(-7 % -3)